import matplotlib.pyplot as plt
from mpl_toolkits.mplot3d import Axes3D
import numpy as np

# 假设我们有一些四维数据：x, y, z 和 val（例如温度）
P = np.array([0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9,1.0,
              0.45,0.4,0.35,0.3,0.25,0.2,0.15,0.1,0.05,
              0.45,0.4,0.35,0.3,0.25,0.2,0.15,0.1,0.05])

A = np.array([0.45,0.4,0.35,0.3,0.25,0.2,0.15,0.1,0.05,0.,
              0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9,
              0.45,0.4,0.35,0.3,0.25,0.2,0.15,0.1,0.05])

F = np.array([0.45,0.4,0.35,0.3,0.25,0.2,0.15,0.1,0.05,0.,
              0.45,0.4,0.35,0.3,0.25,0.2,0.15,0.1,0.05,
              0.1,0.2,0.3,0.4,0.5,0.6,0.7,0.8,0.9])

error = np.array([1.527,
1.8069,
1.9374,
1.5679,
1.9141,
1.5928,
1.4126,
1.6717,
1.5693,
1.5673,
1.9148,
2.191,
1.629,
1.3754,
1.5923,
1.6903,
1.7301,
1.9729,
2.146,
1.7507,
1.56626,
1.6956,
1.8189,
1.9967,
1.7623,
1.7912,
1.8264,
1.7547,])

# 创建一个新的matplotlib图表和轴对象
fig = plt.figure()
ax = fig.add_subplot(111, projection='3d')

# 使用散点图表示数据点
# 颜色映射（colormap）将val值映射到颜色
sc = ax.scatter(P, A, F, c=error, cmap='coolwarm')

# 添加颜色条
plt.colorbar(sc)

# 设置轴标签
ax.set_xlabel('Predict')
ax.set_ylabel('Encoder')
ax.set_zlabel('Fusion')

# 显示图表
plt.show()